
## Plan Result

[CI link](https://github.com/marwenbhriz/gsTerraform/actions/runs/9871444229)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hello.null_resource.default
  * module.pubsub.google_pubsub_topic.notifications


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hello.null_resource.default will be created
  + resource "null_resource" "default" {
      + id = (known after apply)
    }

  # module.pubsub.google_pubsub_topic.notifications will be created
  + resource "google_pubsub_topic" "notifications" {
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "86600s"
      + name                       = "notifications"
      + project                    = "grasys-study"
      + terraform_labels           = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-apply","PRNumber":6,"Program":"tfcmt","SHA1":"a0bfbb56a975f3a5fd9ca3c786352b53028c8082","Vars":{},"WorkflowName":"terraform plan"} -->